**Step1**: Import the necessary libraries

In [6]:
import pandas as pd
import numpy as np

**Step2:** For the datafframe below, compute the mean of the data1 column using the labels from key1.

In [9]:
df = pd.DataFrame({"key1" : ["a", "a", None, "b", "b", "a", None],
                   "key2" : pd.Series([1, 2, 1, 2, 1, None, 1],
                                      dtype="Int64"),
                   "data1" : np.random.standard_normal(7),
                   "data2" : np.random.standard_normal(7)})

**Step3:** Now compute the mean for `data1` grouped by both `key1` and `key2`

In [41]:
means = df['data1'].groupby([df['key1'],df['key2']]).mean()
means.head()

key1  key2
a     1       2.246417
      2       0.229257
b     1      -0.282803
      2      -0.607755
Name: data1, dtype: float64

**Step4** Find the group sizes by `key1` and `key2`.

In [49]:
df.groupby([df['key1'],df['key2']])['data1'].count()

key1  key2
a     1       1
      2       1
b     1       1
      2       1
Name: data1, dtype: int64

**Step5** Iterate over the data grouped by `key1` and \
generate a sequence of 2-tuples containing the group name\
along with the chunk of data.

In [67]:
for name, group in df.groupby('key1'):
    print(name)
    print(group)

a
  key1  key2     data1     data2
0    a     1  2.246417  0.686458
1    a     2  0.229257 -2.165881
5    a  <NA>  0.631544 -1.826323
b
  key1  key2     data1     data2
3    b     2 -0.607755  0.701299
4    b     1 -0.282803 -2.041633

**Step6** Group your data by `key1` and `key2`
then select `data2` and then take the mean of `data2` for each group

In [65]:
df[['data1','data2']].groupby([df['key1'],df['key2']]).mean()

              data1     data2
key1 key2
a    1     2.246417  0.686458
     2     0.229257 -2.165881
b    1    -0.282803 -2.041633
     2    -0.607755  0.701299

**Step7** Group the data below using the mapping and find the sum\
for each person across the columns, for example, a, b, and e are `red`\
c and e are `blue`, so Joe will have the sum of the columns correspoding\
to `red`columns as well as `blue` color.

In [376]:
people = pd.DataFrame(np.random.standard_normal((5, 5)),
                      columns=["a", "b", "c", "d", "e"],
                      index=["Joe", "Steve", "Wanda", "Jill", "Trey"])
people.iloc[2:3, [1, 2]] = np.nan # Add a few NA values

In [378]:
mapping = {"a": "red", "b": "red", "c": "blue",
           "d": "blue", "e": "red", "f" : "orange"}

In [399]:
def group_by_color(df, color_mapping):
    results = pd.DataFrame(index=df.index)
    for color in set(color_mapping.values()):
            color_cols = [col for col, col_color in color_mapping.items() if col_color == color]
            valid_cols = [col for col in color_cols if col in df.columns]
            if valid_cols:
                results[color] = df[valid_cols].sum(axis=1)
    
    return results
print(group_by_color(people,mapping))

           blue       red
Joe   -1.614739  0.475787
Steve  1.133061 -1.634926
Wanda  0.292100 -1.593702
Jill  -2.661497 -0.886934
Trey  -1.418905 -1.001463

**Step8** Read the `tips.csv` dataset

In [69]:
tips = pd.read_csv('tips.csv')

**Step9** Add a tip_pct column with the tip percentage of the total bill

In [335]:
tips.head()

   total_bill   tip smoker  day    time  size    tip_pct
0       16.99  1.01     No  Sun  Dinner     2   5.944673
1       10.34  1.66     No  Sun  Dinner     3  16.054159
2       21.01  3.50     No  Sun  Dinner     3  16.658734
3       23.68  3.31     No  Sun  Dinner     2  13.978041
4       24.59  3.61     No  Sun  Dinner     4  14.680765

In [91]:
tips["tip_pct"] = tips['tip'] / tips['total_bill'] * 100
tips

     total_bill   tip smoker   day    time  size    tip_pct
0         16.99  1.01     No   Sun  Dinner     2   5.944673
1         10.34  1.66     No   Sun  Dinner     3  16.054159
2         21.01  3.50     No   Sun  Dinner     3  16.658734
3         23.68  3.31     No   Sun  Dinner     2  13.978041
4         24.59  3.61     No   Sun  Dinner     4  14.680765
..          ...   ...    ...   ...     ...   ...        ...
239       29.03  5.92     No   Sat  Dinner     3  20.392697
240       27.18  2.00    Yes   Sat  Dinner     2   7.358352
241       22.67  2.00    Yes   Sat  Dinner     2   8.822232
242       17.82  1.75     No   Sat  Dinner     2   9.820426
243       18.78  3.00     No  Thur  Dinner     2  15.974441

[244 rows x 7 columns]

**Step10** 
- Group your data by `day` and `smoker`
- Select the `tip_pct` column from this group
- Find the mean of `tcp_pct` for each grpup using `agg`function

In [177]:
tips.groupby(['day','smoker'])['tip_pct'].agg('mean')

day   smoker
Fri   No        15.165044
      Yes       17.478305
Sat   No        15.804766
      Yes       14.790607
Sun   No        16.011294
      Yes       18.725032
Thur  No        16.029808
      Yes       16.386327
Name: tip_pct, dtype: float64

**Step11** Compute the three statistics `count`, `min`, and `max`\
for the tip_pct and total_bill columns:

In [184]:
tips[['tip_pct','total_bill']].agg(['count', 'min', 'max'])

          tip_pct  total_bill
count  244.000000      244.00
min      3.563814        3.07
max     71.034483       50.81

**Step12**
- Read the dataset `stock_px.csv`
- Create a function that computes the pair-wise correlation of
  each column with the "SPX" column
- Compute percent change on close_px using pct_change

In [292]:
stock= pd.read_csv('stock_px.csv')
stock.head()

            Unnamed: 0  AAPL   MSFT    XOM     SPX
0  2003-01-02 00:00:00  7.40  21.11  29.22  909.03
1  2003-01-03 00:00:00  7.45  21.14  29.24  908.59
2  2003-01-06 00:00:00  7.45  21.52  29.96  929.01
3  2003-01-07 00:00:00  7.43  21.93  28.95  922.93
4  2003-01-08 00:00:00  7.28  21.31  28.83  909.93

**Step13**
- Extract the year part from the data index
- group by your data by year
- find the correlation of each group with `SPX`

In [295]:
stock['year']= pd.DatetimeIndex(stock['Unnamed: 0']).year
print(stock)

               Unnamed: 0    AAPL   MSFT    XOM      SPX  year
0     2003-01-02 00:00:00    7.40  21.11  29.22   909.03  2003
1     2003-01-03 00:00:00    7.45  21.14  29.24   908.59  2003
2     2003-01-06 00:00:00    7.45  21.52  29.96   929.01  2003
3     2003-01-07 00:00:00    7.43  21.93  28.95   922.93  2003
4     2003-01-08 00:00:00    7.28  21.31  28.83   909.93  2003
...                   ...     ...    ...    ...      ...   ...
2209  2011-10-10 00:00:00  388.81  26.94  76.28  1194.89  2011
2210  2011-10-11 00:00:00  400.29  27.00  76.27  1195.54  2011
2211  2011-10-12 00:00:00  402.19  26.96  77.16  1207.25  2011
2212  2011-10-13 00:00:00  408.43  27.18  76.37  1203.66  2011
2213  2011-10-14 00:00:00  422.00  27.27  78.11  1224.58  2011

[2214 rows x 6 columns]

In [307]:

yearly = stock.groupby(['year'])[['AAPL','MSFT','XOM','SPX']].agg('mean')
yearly.head()

            AAPL       MSFT        XOM          SPX
year
2003    9.272619  20.595119  30.211111   965.227540
2004   17.763889  21.850437  38.875437  1130.649444
2005   46.675952  23.072421  51.045476  1207.229444
2006   70.810637  23.759363  58.458406  1310.461633
2007  128.273904  27.904422  75.767131  1477.184343

In [311]:
yearly.corr()['SPX'].drop('SPX')

AAPL    0.222565
MSFT    0.800810
XOM     0.543283
Name: SPX, dtype: float64

**Step14** 
- A pivot table is a data summarization tool frequently found\
  in spreadsheet programs and other data analysis software.\
  It aggregates a table of data by one or more keys, arranging\
  the data in a rectangle with some of the group keys along the\
  rows and some along the columns.
- Compute a table of group means (the default pivot_table aggregation type)\
  arranged by day and smoker on the rows

In [365]:
tips = pd.read_csv('tips.csv')

In [363]:
pivot_result = tips.pivot_table( values='total_bill', columns=['day','smoker'])
print(pivot_result)

day           Fri                   Sat                   Sun         \
smoker         No        Yes         No        Yes         No    Yes
total_bill  18.42  16.813333  19.661778  21.276667  20.506667  24.12

day              Thur
smoker             No        Yes
total_bill  17.113111  19.190588